[
    {
        "title": "Auxilo Education Loan",
        "name": "auxilo",
        "logo": "h_auxillo.png",
        "description": [
            {
                "text": "<b>Eligibility:</b> Indian students who have secured admission to a recognized college or university in India or abroad are eligible to apply for an Auxilo Education Loan. The minimum age limit for the applicant is 18 years, and the maximum age limit is 35 years"
            },
            {
                "text": "<b>Courses covered:</b> Auxilo Education Loan covers a wide range of courses, including engineering, management, medical, hospitality, law, and others. The loan also covers vocational courses and skill development courses."
            },
            {
                "text": "<b>Loan amount:</b> The loan amount offered by Auxilo Education Loan can range from Rs. 50,000 to Rs. 40 lakhs, depending on the course and institution chosen by the student."
            },
            {
                "text": "<b>Interest rate:</b> Auxilo Education Loan offers education loans at competitive interest rates, which range from 10.5% to 15.2%. The interest rate depends on various factors such as the loan amount, course, institution, and creditworthiness of the borrower."
            },
            {
                "text": "<b>Repayment:</b> Auxilo Education Loan offers flexible repayment options, allowing students to start repaying their loan after the completion of their course. The repayment tenure can range from 12 months to 180 months."
            },
            {
                "text": "<b>Collateral:</b> Auxilo Education Loan offers both secured and unsecured education loans. Students can offer collateral such as property or investments to avail of a secured education loan. However, students who do not have collateral can also apply for an unsecured education loan."
            },
            {
                "text": "<b>Application process:</b> The application process for an Auxilo Education Loan is simple and can be done online. Students need to fill in the application form, submit the required documents, and await approval."
            },
            {
                "text": "<b>Other features:</b> Auxilo Education Loan also offers various other features such as online account management, loan disbursement directly to the institution, pre-approved offers, and customized education loan solutions."
            },
            {
                "text": "Overall, Auxilo Education Loan provides a hassle-free and flexible way for students to finance their higher education. Students can choose from a wide range of courses and institutions and enjoy competitive interest rates and flexible repayment options"
            }
        ],
        "table": {
            "Minimum age limit": "18",
            "Maximum age limit": "35",
            "Loan Amount": "50,000 to Rs. 40 lakhs",
            "Interest Rate": "10.5% to 15.2%",
            "Repayment Tenure": "12 to 180 months",
            "Collateral": "Optional"
        }
    },
    {
        "title": "Bank of Baroda",
        "name": "bank-of-baroda",
        "logo": "h_bob.png",
        "content": "Bank of Baroda is one of the leading public sector banks in India that offers a range of financial products and services, including education loans. Here's all you need to know about Bank of Baroda Education Loan:",
        "description": [
            {
                "text": "<b>Eligibility:</b>  Students who are Indian citizens or NRIs are eligible to apply for a Bank of Baroda Education Loan. The minimum age limit for the applicant is 18 years, and the maximum age limit is 35 years."
            },
            {
                "text": "<b>Courses covered:</b>  Bank of Baroda offers education loans for a wide range of courses, including engineering, management, medical, hospitality, law, and others. The loan also covers vocational courses and skill development courses."
            },
            {
                "text": "<b>Loan amount:</b>  The loan amount offered by Bank of Baroda can range from Rs. 1 lakh to Rs. 80 lakhs, depending on the course and institution chosen by the student."
            },
            {
                "text": "<b>Interest rate:</b>  Bank of Baroda offers education loans at competitive interest rates, which range from 6.75% to 8.75%. The interest rate depends on various factors such as the loan amount, course, institution, and creditworthiness of the borrower."
            },
            {
                "text": "<b>Repayment:</b>  Bank of Baroda offers flexible repayment options, allowing students to start repaying their loan after the completion of their course. The repayment tenure can range from 84 months to 180 months."
            },
            {
                "text": "<b>Collateral:</b>  Bank of Baroda offers both secured and unsecured education loans. Students can offer collateral such as property or investments to avail of a secured education loan. However, students who do not have collateral can also apply for an unsecured education loan."
            },
            {
                "text": "<b>Application process:</b>  The application process for a Bank of Baroda Education Loan is simple and can be done online. Students need to fill in the application form, submit the required documents, and await approval."
            },
            {
                "text": "<b>Other features:</b>  Bank of Baroda also offers various other features such as online account management, loan disbursement directly to the institution, and a moratorium period of 6 months to 1 year."
            }
        ],
        "footer": "Overall, Bank of Baroda Education Loans offer a hassle-free and flexible way for students to finance their higher education. Students can choose from a wide range of courses and institutions and enjoy competitive interest rates and flexible repayment options.",
        "table": {
            "Minimum age limit": "18",
            "Maximum age limit": "35",
            "Loan Amount": "1 lakh to Rs. 80 lakhs",
            "Interest Rate": "6.75% to 8.75%",
            "Repayment Tenure": "84 to 180 months",
            "Collateral": "Optional"
        }
    },
    {
        "title": "IDFC Bank",
        "name": "idfc-bank",
        "logo": "idfc.jpeg",
        "content": "IDFC First Bank is one of the leading private sector banks in India that offers a range of financial products and services, including education loans. Here's all you need to know about IDFC First Bank Education Loan:",
        "description": [
            {
                "text": "<b>Eligibility:</b>  Students who are Indian citizens or NRIs are eligible to apply for an IDFC First Bank Education Loan. The minimum age limit for the applicant is 18 years, and the maximum age limit is 35 years."
            },
            {
                "text": "<b>Courses covered:</b>  IDFC First Bank offers education loans for a wide range of courses, including engineering, management, medical, hospitality, law, and others. The loan also covers vocational courses and skill development courses."
            },
            {
                "text": "<b>Loan amount:</b>  The loan amount offered by IDFC First Bank can range from Rs. 50,000 to Rs. 1.5 crores, depending on the course and institution chosen by the student."
            },
            {
                "text": "<b>Interest rate:</b>  IDFC First Bank offers education loans at competitive interest rates, which range from 9.50% to 13.50%. The interest rate depends on various factors such as the loan amount, course, institution, and creditworthiness of the borrower."
            },
            {
                "text": "<b>Repayment:</b>  IDFC First Bank offers flexible repayment options, allowing students to start repaying their loan after the completion of their course. The repayment tenure can range from 12 months to 180 months."
            },
            {
                "text": "<b>Collateral:</b>  IDFC First Bank offers both secured and unsecured education loans. Students can offer collateral such as property or investments to avail of a secured education loan. However, students who do not have collateral can also apply for an unsecured education loan."
            },
            {
                "text": "<b>Application process:</b>  The application process for an IDFC First Bank Education Loan is simple and can be done online. Students need to fill in the application form, submit the required documents, and await approval."
            },
            {
                "text": "<b>Other features:</b>  IDFC First Bank also offers various other features such as pre-approved offers, customized education loan solutions, and online account management."
            }
        ],
        "footer": "Overall, IDFC First Bank Education Loans offer a hassle-free and flexible way for students to finance their higher education. Students can choose from a wide range of courses and institutions and enjoy competitive interest rates and flexible repayment options",
        "table": {
            "Minimum age limit": "18",
            "Maximum age limit": "35",
            "Loan Amount": "50,000 to Rs. 1.5 crores",
            "Interest Rate": "9.50% to 13.50%",
            "Repayment Tenure": "12 to 180 months",
            "Collateral": "Optional"
        }
    },
    {
        "title": "Prodigy Finance",
        "name": "prodigy-finance",
        "logo": "prodigy.png",
        "content": "Prodigy Finance is a UK-based financial services company that provides education loans to students who wish to pursue higher education at top universities globally. Here's all you need to know about Prodigy Finance Education Loan:",
        "description": [
            {
                "text": "<b>Eligibility:</b>  Prodigy Finance offers loans to students who are enrolled in or have received an offer from one of the eligible universities. The loan is available to students from over 150 countries."
            },
            {
                "text": "<b>Courses covered:</b>  Prodigy Finance offers education loans for a wide range of courses, including engineering, management, medical, law, and others. The loan covers full-time postgraduate programs, including MBAs, Masters, and PhDs."
            },
            {
                "text": "<b>Loan amount:</b>  The loan amount offered by Prodigy Finance can range from $15,000 to $500,000, depending on the course and institution chosen by the student."
            },
            {
                "text": "<b>Interest rate:</b>  Prodigy Finance offers education loans at competitive interest rates, which range from 10.5% to 14.5%. The interest rate depends on various factors such as the loan amount, course, institution, and creditworthiness of the borrower."
            },
            {
                "text": "<b>Repayment:</b>  Prodigy Finance offers flexible repayment options, allowing students to start repaying their loan after the completion of their course. The repayment tenure can range from 7 years to 15 years."
            },
            {
                "text": "<b>Collateral:</b>  Prodigy Finance offers unsecured education loans. Students do not need to provide any collateral to avail of the loan."
            },
            {
                "text": "<b>Application process:</b>  The application process for a Prodigy Finance education loan is simple and can be done online. Students need to fill in the application form, submit the required documents, and await approval."
            },
            {
                "text": "<b>Other features:</b>  Prodigy Finance also offers various other features such as loan top-ups, no co-signer requirement, and online account management."
            }
        ],
        "footer": "Overall, Prodigy Finance Education Loan offers a flexible way for students to finance their higher education at top universities globally. Students can choose from a wide range of courses and institutions and enjoy competitive interest rates and flexible repayment options",
        "table": {
            "Eligibility": "enrolled in or have received an offer from one of the eligible universities.",
            "Loan Amount": "$15,000 to $500,000",
            "Interest Rate": "9.50% to 13.50%",
            "Repayment Tenure": "7 to 15 years",
            "Collateral": "Optional"
        }
    },
    {
        "title": "Avance Finacial Services",
        "name": "avanse",
        "logo": "h_avanse.png",
        "content": "Avanse Financial Services is a leading Indian non-banking financial company (NBFC) that specializes in providing education loans to students who wish to pursue higher education in India or abroad. Here's all you need to know about Avanse Education Loans:",
        "description": [
            {
                "text": "<b>Eligibility:</b>  Students who are Indian citizens or NRIs are eligible to apply for an Avanse education loan. The minimum age limit for the applicant is 18 years, and the maximum age limit is 35 years."
            },
            {
                "text": "<b>Courses covered:</b>  Avanse offers education loans for a wide range of courses, including engineering, management, medical, hospitality, law, and others. The loan also covers vocational courses and skill development courses."
            },
            {
                "text": "<b>Loan amount:</b>  The loan amount offered by Avanse can range from Rs. 5,00,000 to Rs. 75 lakhs, depending on the course and institution chosen by the student."
            },
            {
                "text": "<b>Interest rate:</b>  Avanse offers education loans at competitive interest rates, which range from 10.25% to 16.50%. The interest rate depends on various factors such as the loan amount, course, institution, and collateral offered."
            },
            {
                "text": "<b>Repayment:</b>  Avanse offers flexible repayment options, allowing students to start repaying their loan after the completion of their course. The repayment tenure can range from 12 months to 180 months."
            },
            {
                "text": "<b>Collateral:</b>  Avanse offers both secured and unsecured education loans. Students can offer collateral such as property or investments to avail of a secured education loan. However, students who do not have collateral can also apply for an unsecured education loan."
            },
            {
                "text": "<b>Application process:</b>  The application process for an Avanse education loan is simple and can be done online. Students need to fill in the application form, submit the required documents, and await approval."
            },
            {
                "text": "<b>Other features:</b>  Avanse also offers various other features such as pre-approved offers, customized education loan solutions, and online account management."
            }
        ],
        "footer": "Overall, Avanse Education Loans offer a hassle-free and flexible way for students to finance their higher education. Students can choose from a wide range of courses and institutions and enjoy competitive interest rates and flexible repayment options.",
        "table": {
            "Minimum age limit": "18",
            "Maximum age limit": "35",
            "Loan Amount": "5,00,000 to Rs. 75 lakhs",
            "Interest Rate": "10.25% to 16.50%",
            "Repayment Tenure": "12 to 180 months",
            "Collateral": "Optional"
        }
    },
    {
        "title": "HDFC Credelia",
        "name": "hdfc-credelia",
        "logo": "h_hdfc.png",
        "content": "HDFC Credila is an Indian non-banking financial company (NBFC) that specializes in providing education loans to students who are seeking to pursue higher education in India or abroad. Here's all you need to know about HDFC Credila Education Loan:",
        "description": [
            {
                "text": "<b>Eligibility:</b>  Students who are Indian citizens or NRIs are eligible to apply for an HDFC Credila education loan. The minimum age limit for the applicant is 18 years, and the maximum age limit is 35 years."
            },
            {
                "text": "<b>Courses covered:</b>  HDFC Credila offers education loans for a wide range of courses, including engineering, management, medical, hospitality, law, and others. The loan also covers vocational courses and skill development courses."
            },
            {
                "text": "<b>Loan amount:</b>  The loan amount offered by HDFC Credila can range from Rs. 1 lakh to Rs. 75 lakhs, depending on the course and institution chosen by the student."
            },
            {
                "text": "<b>Interest rate:</b>  HDFC Credila offers education loans at competitive interest rates, which range from 9.25% to 13.00%. The interest rate depends on various factors such as the loan amount, course, institution, and collateral offered."
            },
            {
                "text": "<b>Repayment:</b>  HDFC Credila offers flexible repayment options, allowing students to start repaying their loan after the completion of their course. The repayment tenure can range from 5 years to 14 years."
            },
            {
                "text": "<b>Collateral:</b>  HDFC Credila offers both secured and unsecured education loans. Students can offer collateral such as property or investments to avail of a secured education loan. However, students who do not have collateral can also apply for an unsecured education loan."
            },
            {
                "text": "<b>Application process:</b>  The application process for an HDFC Credila education loan is simple and can be done online. Students need to fill in the application form, submit the required documents, and await approval."
            }
        ],
        "footer": "Overall, HDFC Credila Education Loan offers a hassle-free and flexible way for students to finance their higher education. Students can choose from a wide range of courses and institutions and enjoy competitive interest rates and flexible repayment options.",
        "table": {
            "Minimum age limit": "18",
            "Maximum age limit": "35",
            "Loan Amount": "1 lakh to 75 lakhs",
            "Interest Rate": "9.25% to 13.00%",
            "Repayment Tenure": "5 to 14 years",
            "Collateral": "Optional"
        }
    }
]
